{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [4, 4, 2, 32], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_6/bias"}, {"dtype": "float32", "shape": [4, 4, 32, 32], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_7/bias"}, {"dtype": "float32", "shape": [4, 4, 32, 32], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_8/bias"}, {"dtype": "float32", "shape": [128, 64], "name": "dense_10/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_10/bias"}, {"dtype": "float32", "shape": [64, 1], "name": "dense_11/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_11/bias"}, {"dtype": "float32", "shape": [1344, 128], "name": "dense_8/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_8/bias"}, {"dtype": "float32", "shape": [128, 128], "name": "dense_9/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_9/bias"}]}], "modelTopology": {"training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy", "binary_crossentropy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.9, "beta_2": 0.999, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0001, "amsgrad": false}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 6, 7, 2], "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_12", "alpha": 0.30000001192092896}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_13", "alpha": 0.30000001192092896}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_14", "alpha": 0.30000001192092896}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_2", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_15", "alpha": 0.30000001192092896}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_16", "alpha": 0.30000001192092896}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 64, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_17", "alpha": 0.30000001192092896}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_2"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.6", "format": "layers-model"}